MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F4013/mcu.h
/* Generic structure of entire SFR area for each SPI module */
typedef struct tagSPI {
        uint16_t spixstat;
        uint16_t spixcon1;
        uint16_t spixcon2;
        uint16_t unused;
        uint16_t spixbuf;
} SPI, *PSPI;

#define SPIxSTATBITS SPI1STATBITS
#define SPIxCONBITS SPI1CONBITS


/* SFR blocks for each SPI module */
#define SPI1 SPI1
extern volatile SPI SPI1 __attribute__((__sfr__));

#define SPI1STAT SPI1STAT
extern volatile uint16_t SPI1STAT __attribute__((__sfr__));
typedef struct tagSPI1STATBITS {
  uint16_t SPIRBF:1;
  uint16_t SPITBF:1;
  uint16_t :4;
  uint16_t SPIROV:1;
  uint16_t :6;
  uint16_t SPISIDL:1;
  uint16_t :1;
  uint16_t SPIEN:1;
} SPI1STATBITS;
extern volatile SPI1STATBITS SPI1STATbits __attribute__((__sfr__));

#define SPI1CON SPI1CON
extern volatile uint16_t SPI1CON __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CONBITS {
  union {
    struct {
      uint16_t PPRE0:1;
      uint16_t PPRE1:1;
      uint16_t SPRE0:1;
      uint16_t SPRE1:1;
      uint16_t SPRE2:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t DISSDO:1;
      uint16_t :1;
      uint16_t SPIFSD:1;
      uint16_t FRMEN:1;
    };
    struct {
      uint16_t PPRE:2;
      uint16_t SPRE:3;
    };
  };
} SPI1CONBITS;
extern volatile SPI1CONBITS SPI1CONbits __attribute__((__sfr__));

#define SPI1BUF SPI1BUF
extern volatile uint16_t SPI1BUF __attribute__((__sfr__));
#define DCICON1 DCICON1
extern volatile uint16_t DCICON1 __attribute__((__sfr__));
__extension__ typedef struct tagDCICON1BITS {
  union {
    struct {
      uint16_t COFSM:2;
      uint16_t :3;
      uint16_t DJST:1;
      uint16_t CSDOM:1;
      uint16_t UNFM:1;
      uint16_t COFSD:1;
      uint16_t CSCKE:1;
      uint16_t CSCKD:1;
      uint16_t DLOOP:1;
      uint16_t :1;
      uint16_t DCISIDL:1;
      uint16_t :1;
      uint16_t DCIEN:1;
    };
    struct {
      uint16_t COFSM0:1;
      uint16_t COFSM1:1;
    };
  };
} DCICON1BITS;
extern volatile DCICON1BITS DCICON1bits __attribute__((__sfr__));

#define DCICON2 DCICON2
extern volatile uint16_t DCICON2 __attribute__((__sfr__));
__extension__ typedef struct tagDCICON2BITS {
  union {
    struct {
      uint16_t WS:4;
      uint16_t :1;
      uint16_t COFSG:4;
      uint16_t :1;
      uint16_t BLEN:2;
    };
    struct {
      uint16_t WS0:1;
      uint16_t WS1:1;
      uint16_t WS2:1;
      uint16_t WS3:1;
      uint16_t :1;
      uint16_t COFSG0:1;
      uint16_t COFSG1:1;
      uint16_t COFSG2:1;
      uint16_t COFSG3:1;
      uint16_t :1;
      uint16_t BLEN0:1;
      uint16_t BLEN1:1;
    };
  };
} DCICON2BITS;
extern volatile DCICON2BITS DCICON2bits __attribute__((__sfr__));

#define DCICON3 DCICON3
extern volatile uint16_t DCICON3 __attribute__((__sfr__));
__extension__ typedef struct tagDCICON3BITS {
  union {
    struct {
      uint16_t BCG:12;
    };
    struct {
      uint16_t BCG0:1;
      uint16_t BCG1:1;
      uint16_t BCG2:1;
      uint16_t BCG3:1;
      uint16_t BCG4:1;
      uint16_t BCG5:1;
      uint16_t BCG6:1;
      uint16_t BCG7:1;
      uint16_t BCG8:1;
      uint16_t BCG9:1;
      uint16_t BCG10:1;
      uint16_t BCG11:1;
    };
  };
} DCICON3BITS;
extern volatile DCICON3BITS DCICON3bits __attribute__((__sfr__));

#define DCISTAT DCISTAT
extern volatile uint16_t DCISTAT __attribute__((__sfr__));
__extension__ typedef struct tagDCISTATBITS {
  union {
    struct {
      uint16_t TMPTY:1;
      uint16_t TUNF:1;
      uint16_t RFUL:1;
      uint16_t ROV:1;
      uint16_t :4;
      uint16_t SLOT:4;
    };
    struct {
      uint16_t :8;
      uint16_t SLOT0:1;
      uint16_t SLOT1:1;
      uint16_t SLOT2:1;
      uint16_t SLOT3:1;
    };
  };
} DCISTATBITS;
extern volatile DCISTATBITS DCISTATbits __attribute__((__sfr__));

#define TSCON TSCON
extern volatile uint16_t TSCON __attribute__((__sfr__));
typedef struct tagTSCONBITS {
  uint16_t TSE0:1;
  uint16_t TSE1:1;
  uint16_t TSE2:1;
  uint16_t TSE3:1;
  uint16_t TSE4:1;
  uint16_t TSE5:1;
  uint16_t TSE6:1;
  uint16_t TSE7:1;
  uint16_t TSE8:1;
  uint16_t TSE9:1;
  uint16_t TSE10:1;
  uint16_t TSE11:1;
  uint16_t TSE12:1;
  uint16_t TSE13:1;
  uint16_t TSE14:1;
  uint16_t TSE15:1;
} TSCONBITS;
extern volatile TSCONBITS TSCONbits __attribute__((__sfr__));

#define RSCON RSCON
extern volatile uint16_t RSCON __attribute__((__sfr__));
typedef struct tagRSCONBITS {
  uint16_t RSE0:1;
  uint16_t RSE1:1;
  uint16_t RSE2:1;
  uint16_t RSE3:1;
  uint16_t RSE4:1;
  uint16_t RSE5:1;
  uint16_t RSE6:1;
  uint16_t RSE7:1;
  uint16_t RSE8:1;
  uint16_t RSE9:1;
  uint16_t RSE10:1;
  uint16_t RSE11:1;
  uint16_t RSE12:1;
  uint16_t RSE13:1;
  uint16_t RSE14:1;
  uint16_t RSE15:1;
} RSCONBITS;
extern volatile RSCONBITS RSCONbits __attribute__((__sfr__));

#define RXBUF0 RXBUF0
extern volatile uint16_t RXBUF0 __attribute__((__sfr__));
#define RXBUF1 RXBUF1
extern volatile uint16_t RXBUF1 __attribute__((__sfr__));
#define RXBUF2 RXBUF2
extern volatile uint16_t RXBUF2 __attribute__((__sfr__));
#define RXBUF3 RXBUF3
extern volatile uint16_t RXBUF3 __attribute__((__sfr__));
#define TXBUF0 TXBUF0
extern volatile uint16_t TXBUF0 __attribute__((__sfr__));
#define TXBUF1 TXBUF1
extern volatile uint16_t TXBUF1 __attribute__((__sfr__));
#define TXBUF2 TXBUF2
extern volatile uint16_t TXBUF2 __attribute__((__sfr__));
#define TXBUF3 TXBUF3
extern volatile uint16_t TXBUF3 __attribute__((__sfr__));
#define ADCBUF0 ADCBUF0
extern volatile uint16_t ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile uint16_t ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile uint16_t ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile uint16_t ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile uint16_t ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile uint16_t ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile uint16_t ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile uint16_t ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile uint16_t ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile uint16_t ADCBUF9 __attribute__((__sfr__));
#define ADCBUFA ADCBUFA
extern volatile uint16_t ADCBUFA __attribute__((__sfr__));
#define ADCBUFB ADCBUFB
extern volatile uint16_t ADCBUFB __attribute__((__sfr__));
#define ADCBUFC ADCBUFC
extern volatile uint16_t ADCBUFC __attribute__((__sfr__));
#define ADCBUFD ADCBUFD
extern volatile uint16_t ADCBUFD __attribute__((__sfr__));
#define ADCBUFE ADCBUFE
extern volatile uint16_t ADCBUFE __attribute__((__sfr__));
#define ADCBUFF ADCBUFF
extern volatile uint16_t ADCBUFF __attribute__((__sfr__));
#define ADCON1 ADCON1
extern volatile uint16_t ADCON1 __attribute__((__sfr__));
__extension__ typedef struct tagADCON1BITS {
  union {
    struct {
      uint16_t DONE:1;
      uint16_t SAMP:1;
      uint16_t ASAM:1;
      uint16_t :2;
      uint16_t SSRC:3;
      uint16_t FORM:2;
      uint16_t :3;
      uint16_t ADSIDL:1;
      uint16_t :1;
      uint16_t ADON:1;
    };
    struct {
      uint16_t :5;
      uint16_t SSRC0:1;
      uint16_t SSRC1:1;
      uint16_t SSRC2:1;
      uint16_t FORM0:1;
      uint16_t FORM1:1;
    };
  };
} ADCON1BITS;
