MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F4013/mcu.h
extern volatile C1CFG1BITS C1CFG1bits __attribute__((__sfr__));

#define C1CFG2 C1CFG2
extern volatile uint16_t C1CFG2 __attribute__((__sfr__));
__extension__ typedef struct tagC1CFG2BITS {
  union {
    struct {
      uint16_t PRSEG:3;
      uint16_t SEG1PH:3;
      uint16_t SAM:1;
      uint16_t SEG2PHTS:1;
      uint16_t SEG2PH:3;
      uint16_t :3;
      uint16_t WAKFIL:1;
    };
    struct {
      uint16_t PRSEG0:1;
      uint16_t PRSEG1:1;
      uint16_t PRSEG2:1;
      uint16_t SEG1PH0:1;
      uint16_t SEG1PH1:1;
      uint16_t SEG1PH2:1;
      uint16_t :2;
      uint16_t SEG2PH0:1;
      uint16_t SEG2PH1:1;
      uint16_t SEG2PH2:1;
    };
  };
} C1CFG2BITS;
extern volatile C1CFG2BITS C1CFG2bits __attribute__((__sfr__));

#define C1INTF C1INTF
extern volatile uint16_t C1INTF __attribute__((__sfr__));
__extension__ typedef struct tagC1INTFBITS {
  union {
    struct {
      uint16_t RXB0IF:1;
      uint16_t RXB1IF:1;
      uint16_t TXB0IF:1;
      uint16_t TXB1IF:1;
      uint16_t TXB2IF:1;
      uint16_t ERRIF:1;
      uint16_t WAKIF:1;
      uint16_t IRXIF:1;
      uint16_t EWARN:1;
      uint16_t RXWARN:1;
      uint16_t TXWARN:1;
      uint16_t RXBP:1;
      uint16_t TXBP:1;
      uint16_t TXBO:1;
      uint16_t RXB1OVFL:1;
      uint16_t RXB0OVFL:1;
    };
    struct {
      uint16_t RX0IF:1;
      uint16_t RX1IF:1;
      uint16_t TX0IF:1;
      uint16_t TX1IF:1;
      uint16_t TX2IF:1;
      uint16_t :2;
      uint16_t IVRIF:1;
      uint16_t :1;
      uint16_t RXWAR:1;
      uint16_t TXWAR:1;
      uint16_t RXEP:1;
      uint16_t TXEP:1;
      uint16_t :1;
      uint16_t RX1OVR:1;
      uint16_t RX0OVR:1;
    };
  };
} C1INTFBITS;
extern volatile C1INTFBITS C1INTFbits __attribute__((__sfr__));

#define C1INTE C1INTE
extern volatile uint16_t C1INTE __attribute__((__sfr__));
__extension__ typedef struct tagC1INTEBITS {
  union {
    struct {
      uint16_t RXB0IE:1;
      uint16_t RXB1IE:1;
      uint16_t TXB0IE:1;
      uint16_t TXB1IE:1;
      uint16_t TXB2IE:1;
      uint16_t ERRIE:1;
      uint16_t WAKIE:1;
      uint16_t IRXIE:1;
    };
    struct {
      uint16_t RX0IE:1;
      uint16_t RX1IE:1;
      uint16_t TX0IE:1;
      uint16_t TX1IE:1;
      uint16_t TX2IE:1;
      uint16_t :2;
      uint16_t IVRIE:1;
    };
  };
} C1INTEBITS;
extern volatile C1INTEBITS C1INTEbits __attribute__((__sfr__));

#define C1EC C1EC
extern volatile uint16_t C1EC __attribute__((__sfr__));
typedef struct tagC1ECBITS {
  uint16_t REC0:1;
  uint16_t REC1:1;
  uint16_t REC2:1;
  uint16_t REC3:1;
  uint16_t REC4:1;
  uint16_t REC5:1;
  uint16_t REC6:1;
  uint16_t REC7:1;
  uint16_t TEC0:1;
  uint16_t TEC1:1;
  uint16_t TEC2:1;
  uint16_t TEC3:1;
  uint16_t TEC4:1;
  uint16_t TEC5:1;
  uint16_t TEC6:1;
  uint16_t TEC7:1;
} C1ECBITS;
extern volatile C1ECBITS C1ECbits __attribute__((__sfr__));

#define C1RERRCNT C1RERRCNT
extern volatile uint8_t C1RERRCNT __attribute__((__sfr__));
#define C1TERRCNT C1TERRCNT
extern volatile uint8_t C1TERRCNT __attribute__((__sfr__));
#define RCON RCON
extern volatile uint16_t RCON __attribute__((__sfr__));
__extension__ typedef struct tagRCONBITS {
  union {
    struct {
      uint16_t POR:1;
      uint16_t BOR:1;
      uint16_t IDLE:1;
      uint16_t SLEEP:1;
      uint16_t WDTO:1;
      uint16_t SWDTEN:1;
      uint16_t SWR:1;
      uint16_t EXTR:1;
      uint16_t LVDL:4;
      uint16_t LVDEN:1;
      uint16_t BGST:1;
      uint16_t IOPUWR:1;
      uint16_t TRAPR:1;
    };
    struct {
      uint16_t :8;
      uint16_t LVDL0:1;
      uint16_t LVDL1:1;
      uint16_t LVDL2:1;
      uint16_t LVDL3:1;
    };
  };
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t LPOSCEN:1;
      uint16_t :1;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t POST:2;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :6;
      uint16_t POST0:1;
      uint16_t POST1:1;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

#define OSCCONL OSCCONL
extern volatile uint8_t OSCCONL __attribute__((__sfr__));
#define OSCCONH OSCCONH
extern volatile uint8_t OSCCONH __attribute__((__sfr__));
#define OSCTUN OSCTUN
extern volatile uint16_t OSCTUN __attribute__((__sfr__));
typedef struct tagOSCTUNBITS {
  uint16_t TUN0:1;
  uint16_t TUN1:1;
  uint16_t TUN2:1;
  uint16_t TUN3:1;
} OSCTUNBITS;
extern volatile OSCTUNBITS OSCTUNbits __attribute__((__sfr__));

#define NVMCON NVMCON
extern volatile uint16_t NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      uint16_t PROGOP:7;
      uint16_t :1;
      uint16_t TWRI:1;
      uint16_t :4;
      uint16_t WRERR:1;
      uint16_t WREN:1;
      uint16_t WR:1;
    };
    struct {
      uint16_t PROGOP0:1;
      uint16_t PROGOP1:1;
      uint16_t PROGOP2:1;
      uint16_t PROGOP3:1;
      uint16_t PROGOP4:1;
      uint16_t PROGOP5:1;
      uint16_t PROGOP6:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile uint16_t NVMADR __attribute__((__sfr__));
#define NVMADRU NVMADRU
extern volatile uint16_t NVMADRU __attribute__((__sfr__));
typedef struct tagNVMADRUBITS {
  uint16_t NVMADR:8;
} NVMADRUBITS;
extern volatile NVMADRUBITS NVMADRUbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile uint16_t NVMKEY __attribute__((__sfr__));
#define PMD1 PMD1
extern volatile uint16_t PMD1 __attribute__((__sfr__));
typedef struct tagPMD1BITS {
  uint16_t ADCMD:1;
  uint16_t C1MD:1;
  uint16_t :1;
  uint16_t SPI1MD:1;
  uint16_t :1;
  uint16_t U1MD:1;
  uint16_t U2MD:1;
  uint16_t I2CMD:1;
  uint16_t DCIMD:1;
  uint16_t :2;
  uint16_t T1MD:1;
  uint16_t T2MD:1;
  uint16_t T3MD:1;
  uint16_t T4MD:1;
  uint16_t T5MD:1;
} PMD1BITS;
